update readme and update architecture
